# Домашняя работа 
## Задание первого семинара
*Написать программу вычисления n-ого треугольного числа.*
1. **Есть число**
   
2. **Метод вычисления треугольного числа**
```Java 
// Метод 
static int TriangularNumber(int value){
    return (value*(value+1))/2;
}
// Результат
public static void main(String[] args) {
        int res = TriangularNumber(8);
        System.out.println(res);
}
```
## Задание второго семинара

*Реализовать функцию возведения числа а в степень b. a, b ∈ Z. Сводя количество выполняемых действий к минимуму.*
* *Пример 1: а = 3, b = 2, ответ: 9* 
* *Пример 2: а = 2, b = -2, ответ: 0.25* 
* *Пример 3: а = 3, b = 0, ответ: 1* 
* *Пример 4: а = 0, b = 0, ответ: не определено* 
* *Пример 5
входные данные находятся в файле input.txt в виде
b 3
a 10
Результат нужно сохранить в файле output.txt 
1000*
### Задачи
1. **Программа принимает на вход два числа *a,b***
2. **Метод возведения в степень**
3. **Чтение файла**
4. **Образование нового файла с дальнейшей записью туда результата**


























